<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <base data-ice="baseUrl" href="../../">
  <title data-ice="title">src/AsymmetricCryptography.js | esdoc</title>
  <link type="text/css" rel="stylesheet" href="css/style.css">
  <link type="text/css" rel="stylesheet" href="css/prettify-tomorrow.css">
  <script src="script/prettify/prettify.js"></script>
  <script src="script/manual.js"></script>
</head>
<body class="layout-container" data-ice="rootContainer">

<header>
  <a href="./">Home</a>
  
  <a href="identifiers.html">Reference</a>
  <a href="source.html">Source</a>
  
  <div class="search-box">
  <span>
    <img src="./image/search.png">
    <span class="search-input-edge"></span><input class="search-input"><span class="search-input-edge"></span>
  </span>
    <ul class="search-result"></ul>
  </div>
</header>

<nav class="navigation" data-ice="nav"><div>
  <ul>
    
  <li data-ice="doc"><span data-ice="kind" class="kind-class">C</span><span data-ice="name"><span><a href="class/src/AsymmetricCryptography.js~AsymmetricCryptography.html">AsymmetricCryptography</a></span></span></li>
<li data-ice="doc"><span data-ice="kind" class="kind-class">C</span><span data-ice="name"><span><a href="class/src/HybridCryptography.js~HybridCryptography.html">HybridCryptography</a></span></span></li>
<li data-ice="doc"><span data-ice="kind" class="kind-class">C</span><span data-ice="name"><span><a href="class/src/SymmetricCryptography.js~SymmetricCryptography.html">SymmetricCryptography</a></span></span></li>
<li data-ice="doc"><span data-ice="kind" class="kind-function">F</span><span data-ice="name"><span><a href="function/index.html#static-function-generateKeys">generateKeys</a></span></span></li>
</ul>
</div>
</nav>

<div class="content" data-ice="content"><h1 data-ice="title">src/AsymmetricCryptography.js</h1>
<pre class="source-code line-number raw-source-code"><code class="prettyprint linenums" data-ice="content">import crypto from &quot;crypto&quot;;
import { PASSPHRASE } from &quot;../config&quot;;

/**
 *  Node js &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x62F;&#x627;&#x62E;&#x644;  crypto  &#x62A;&#x634;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x628;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x63A;&#x64A;&#x631; &#x645;&#x62A;&#x646;&#x627;&#x638;&#x631;&#x629; &#x62A;&#x645; &#x628;&#x646;&#x627;&#x621;&#x647; &#x628;&#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F; &#x639;&#x644;&#x649; &#x645;&#x643;&#x62A;&#x628;&#x629;
 * &lt;br/&gt;
 *  decrypt &#x648;&#x62A;&#x627;&#x628;&#x639; &#x641;&#x643; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; encrypt &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x62A;&#x627;&#x628;&#x639;&#x64A;&#x646; &#x631;&#x626;&#x64A;&#x633;&#x64A;&#x646; &#x62A;&#x627;&#x628;&#x639; &#x62A;&#x634;&#x641;&#x64A;&#x631;
 * &lt;br/&gt;
 *&#x627;&#x644;&#x62E;&#x627;&#x635; &#x628;&#x64A; private key  &#x644;&#x644;&#x634;&#x62E;&#x635; &#x627;&#x644;&#x645;&#x631;&#x627;&#x62F; &#x627;&#x631;&#x633;&#x627;&#x644; &#x627;&#x644;&#x62D;&#x648;&#x627;&#x644;&#x629; &#x644;&#x647; &#x648;&#x639;&#x645;&#x644;&#x64A;&#x629; &#x641;&#x643; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x62A;&#x62A;&#x645; &#x628;&#x627;  Public key &#x639;&#x645;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x62A;&#x62A;&#x645; &#x628;
 *&lt;br&gt;
 *
 * @example
 * const asymmetric = new AsymmetricCryptography();
 * asymmetric.setPublicKey(MyPublickey);
 * asymmetric.setPrivateKey(MyPrivetKey);
 * asymmetric.setReceiverPublicKey(ReceiverPublicKey);
 * // can encrypt plain text or json object
 * const data = &quot;....&quot;
 * const enc = asymmetric.encrypt(data)
 * // default return data as json object if you wont return as text we have add option pramiter false
 * const dec = asymmetric.decrypt(enc)
 *
 *
 */

class AsymmetricCryptography {
  constructor() {
    /**
     * @type {String}
     */
    this.publicKey = null;
    /**
     * @type {String}
     */
    this.privateKey = null;
    /**
     * @type {String}
     */
    this.receiverPublicKey = null;
  }
  /**
   * @param {String} key  &#x627;&#x644;&#x645;&#x641;&#x62A;&#x627;&#x62D; &#x627;&#x644;&#x639;&#x627;&#x645; &#x628;&#x627;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644; &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x62A;&#x645; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x628;&#x648;&#x627;&#x633;&#x62A;&#x637;&#x647;
   */
  setReceiverPublicKey(key) {
    this.receiverPublicKey = key;
  }
  /**
   * @param {String} key  &#x627;&#x644;&#x645;&#x641;&#x62A;&#x627;&#x62D; &#x627;&#x644;&#x639;&#x627;&#x645; &#x644;&#x64A;  &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x62A;&#x645; &#x627;&#x639;&#x637;&#x627;&#x626;&#x647; &#x644;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644; &#x627;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x648;&#x627;&#x631;&#x633;&#x627;&#x644;&#x647;&#x627; &#x627;&#x644;&#x64A;
   */
  setPublicKey(key) {
    this.publicKey = key;
  }
  /**
   * @param {String} key  &#x627;&#x644;&#x645;&#x641;&#x62A;&#x627;&#x62D; &#x627;&#x644;&#x62E;&#x627;&#x635; &#x644;&#x64A;  &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x62A;&#x645; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642;&#x647; &#x641;&#x643; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x634;&#x641;&#x631;&#x629; &#x627;&#x644;&#x645;&#x631;&#x633;&#x644;&#x629; &#x627;&#x644;&#x64A;
   */
  setPrivateKey(key) {
    this.privateKey = key;
  }

  /**
   * @return {String} &#x627;&#x644;&#x645;&#x641;&#x62A;&#x627;&#x62D; &#x627;&#x644;&#x639;&#x627;&#x645; &#x644;&#x64A;  &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x62A;&#x645; &#x627;&#x639;&#x637;&#x627;&#x626;&#x647; &#x644;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644; &#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x648;&#x627;&#x631;&#x633;&#x627;&#x644;&#x647;&#x627; &#x627;&#x644;&#x64A;
   */
  getPublicKey() {
    return this.publicKey;
  }

  /**
   * &#x644;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644; public key &#x62A;&#x627;&#x628;&#x639; &#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x62F;&#x627;&#x62A;&#x627; &#x62D;&#x633;&#x628;
   * &lt;br&gt;
   * stringify &#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x62D;&#x648;&#x64A;&#x644;&#x647; &#x627;&#x644;&#x649; &#x646;&#x635; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x639;&#x645;&#x644;&#x64A;&#x629;  json object &#x648;&#x62A;&#x648;&#x627;&#x628;&#x639; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x645;&#x62F;&#x639;&#x648;&#x645;&#x629; &#x628;&#x627;&#x644;&#x645;&#x643;&#x62A;&#x628;&#x629; &#x644;&#x627; &#x62A;&#x633;&#x637;&#x64A;&#x639; &#x62A;&#x634;&#x641;&#x64A;&#x631; &#x633;&#x648;&#x627; &#x627;&#x644;&#x646;&#x635;&#x648;&#x635; &#x644;&#x630;&#x644;&#x643; &#x639;&#x646;&#x62F; &#x627;&#x62F;&#x62E;&#x644; josn object  &#x646;&#x638;&#x627;&#x645;&#x646;&#x627; &#x64A;&#x639;&#x62A;&#x645;&#x62F; &#x639;&#x644;&#x649; &#x62A;&#x628;&#x627;&#x62F;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x628;&#x634;&#x643;&#x644;
   * @param {String} data -&#x627;&#x644;&#x646;&#x635; &#x627;&#x644;&#x645;&#x631;&#x627;&#x62F; &#x62A;&#x634;&#x641;&#x64A;&#x631;&#x647;
   * @return {String} &#x627;&#x644;&#x62F;&#x627;&#x62A;&#x627; &#x627;&#x644;&#x645;&#x634;&#x641;&#x631;&#x629; ((&#x64A;&#x62A;&#x645; &#x641;&#x643; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631; &#x628;&#x627;&#x644;&#x645;&#x641;&#x62A;&#x627;&#x62D; &#x627;&#x644;&#x62E;&#x627;&#x635; &#x628;&#x627;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644; &#x62D;&#x635;&#x631;&#x627; )) 
   */
  encrypt(data) {
    if (typeof data == &quot;object&quot;) data = JSON.stringify(data);
    const buffer = Buffer.from(data, &quot;utf8&quot;);

    const encrypted = crypto.publicEncrypt(this.receiverPublicKey, buffer);

    return encrypted.toString(&quot;base64&quot;);
  }

    /**
   *  prive key &#x62A;&#x627;&#x628;&#x639; &#x644;&#x641;&#x643; &#x62A;&#x634;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x62F;&#x627;&#x62A;&#x627; &#x62D;&#x633;&#x628;
   * &lt;br&gt;
   * @param {Object} data - &#x627;&#x644;&#x627;&#x628;&#x62C;&#x64A;&#x643;&#x62A; &#x627;&#x644;&#x645;&#x631;&#x627;&#x62F; &#x641;&#x643; &#x62A;&#x634;&#x641;&#x64A;&#x631;&#x647;
   * @param {Boolean} returnJson -&#x648;&#x627;&#x644;&#x627; &#x64A;&#x631;&#x62F;&#x647; &#x643;&#x646;&#x635; Json &#x64A;&#x631;&#x62F; &#x627;&#x644;&#x62E;&#x631;&#x62C;   True &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A; &#x641;&#x64A; &#x62D;&#x627;&#x644;  
   * @return {Object} ; &#x646;&#x62A;&#x64A;&#x62C;&#x629; &#x641;&#x643; &#x627;&#x644;&#x62A;&#x634;&#x641;&#x64A;&#x631;
   */

  decrypt(data, returnJson = true) {
    const buffer = Buffer.from(data, &quot;base64&quot;);
    const decrypted = crypto.privateDecrypt(
      { key: this.privateKey.toString(), passphrase: PASSPHRASE },
      buffer
    );
    return returnJson
      ? JSON.parse(decrypted.toString(&quot;utf8&quot;))
      : decrypted.toString(&quot;utf8&quot;);
  }
}

export default AsymmetricCryptography;
</code></pre>

</div>

<footer class="footer">
  Generated by <a href="https://esdoc.org">ESDoc<span data-ice="esdocVersion">(1.1.0)</span><img src="./image/esdoc-logo-mini-black.png"></a>
</footer>

<script src="script/search_index.js"></script>
<script src="script/search.js"></script>
<script src="script/pretty-print.js"></script>
<script src="script/inherited-summary.js"></script>
<script src="script/test-summary.js"></script>
<script src="script/inner-link.js"></script>
<script src="script/patch-for-local.js"></script>
</body>
</html>
